{"projects":[
  {
    "projectName": "VIPT SaaS",
    "id": 0,
    "excerpt": "A platform for personal trainers to create workouts & nutrition plans, send notifications, process payments & more.",
    "descriptionP1": "Before becoming a developer, I was a personal trainer for many years. I know the industry well and I wanted to build a management tool to assist personal trainers to operate their business more effectively. There are very few all-in-one platforms available for personal trainers and that’s where VIPT comes in.",
    "descriptionP2": "VIPT is still under development, however I will be offering this application as a commercial product in the near future.",
    "descriptionP3": "",
    "link": "",
    "mainImage": "./assets/vipt-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": true,
    "firebase": true,
    "development": true
  },
  {
    "projectName": "Tasti eCommerce",
    "id": 1,
    "excerpt": "A fully featured online shop including Stripe payment integration, AusPost shipping integration and much more.",
    "descriptionP1": "Tasti eCommerce is a fully functional online shop, however it’s not a real business. I wanted to build an online store from scratch using Vue, complete with all of the common functionality you’d expect to see from a modern online store.",
    "descriptionP2": "",
    "descriptionP3": "This project is still under development.",
    "link": "",
    "mainImage": "./assets/tasti-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": true,
    "firebase": true,
    "development": true
  },
  {
    "projectName": "JS Flashify",
    "id": 2,
    "excerpt": "A learning tool to help myself & others memorise JavaScript fundamentals as well as useful methods, functions & objects.",
    "descriptionP1": "When I began learning JavaScript, I thought about creating my own flash cards to help me memorise common array methods, frequently used functions and fundamental principles. Then it occurred to me, why not create an application instead? So I did.",
    "descriptionP2": "I decided to use Vue.js for this project due to its speed, the ability to build using components and simply because Vue is really cool. 😎 The backend is using Firebase for the database, authentication and file storage. As you scroll through the cards, you’re presented with a question. Think about it and answer the question in your head, click on the card to flip it around and view the answer. If you got it right, click on the green check mark box. If you got it wrong, click on the red cross box. Then proceed to the next card. Your answers to each card are stored in the database. ",
    "descriptionP3": "This project is still under development, however once it’s completed I will be making JS Flashify publicly available for anyone to use as an educational tool.",
    "link": "https://003.danielbirch.dev/",
    "mainImage": "./assets/js-flash-cards-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "development": true
  },
  {
    "projectName": "Counter",
    "id": 3,
    "excerpt": "This was the first project I completed without any tutorials. I researched and implemented local storage to achieve save, load and reset functionality.",
    "descriptionP1": "Incremental Counter allows the user to keep count by manually clicking the plus and minus buttons. The program allows you to save a number to local storage by clicking ‘Save’, to reset the display to zero by clicking ‘Reset’ and to load the previously saved number by clicking ‘Load’.",
    "descriptionP2": "While building this program I learned about using and interacting with local storage. It was a milestone for me, as it’s the first JavaScript program I wrote by myself.",
    "descriptionP3": "",
    "link": "https://002.danielbirch.dev/",
    "mainImage": "./assets/counter-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": false,
    "tailwind": false,
    "firebase": false,
    "development": false
  },
  {
    "projectName": "To Do List",
    "id": 4,
    "excerpt": "This was my first real JavaScript project. I followed a tutorial while also adding my own code which shows a message when all tasks are complete.",
    "descriptionP1": "This was my first real JavaScript project. I followed a tutorial while also adding my own code which shows a message when all tasks are complete.",
    "descriptionP2": "",
    "descriptionP3": "",
    "link": "https://001.danielbirch.dev/",
    "mainImage": "./assets/todo-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": false,
    "tailwind": false,
    "firebase": false,
    "development": false
  }
]}