{ "projects": [
  {
    "projectName": "Side Gate Builder",
    "id": 0,
    "excerpt": "A direct sales & lead generation app designed to make it easier for customers to create their own side gate packages, receive quotes & place orders using Stripe.",
    "descriptionP1": "Designed to make it easy for customers to order their own custom DIY side gate kits, this app has successfully been used to generate six figures in sales since it was launched.",
    "descriptionP2": "The app saves all quotes to a Firestore database, has Stripe integration for payments and a backend Node.js server used to create new products within Stripe prior to checkout. I used EmailJS to send quote and order emails to both the company and the prospect/customer. It also has progressive web app (PWA) functionality.",
    "descriptionP3": "I continue to add new features and maintain the app. It's an excellent example of taking a complex process and simplifying it so that the customer is able to generate their own quotes and place an order when they're ready.",
    "link": "https://sidegate.supergates.com.au",
    "mainImage": "./assets/sg-diy-side-gate-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": false
  },
  {
    "projectName": "Fencing Estimator",
    "id": 1,
    "excerpt": "The Side Gate Builder was duplicated and repurposed to generate commercial fencing & gate estimates and send the estimates to the client via email.",
    "descriptionP1": "During the development process of the Side Gate Builder, the client expressed an interest in having a similar app to be able to generate estimates for fencing & gate projects. ",
    "descriptionP2": "This app also saves all estimates into a Firestore database, is integrated with EmailJS for sending estimates to the client and also generates a PDF of the estimate summary. Apart from the UI which was cloned, all the functionality for this app was completed within 4 weeks, whilst I was simultaneously working on the Side Gate Builder.",
    "descriptionP3": "",
    "link": "https://fencing.supergates.com.au",
    "mainImage": "./assets/fencing-estimator-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": false
  },
  {
    "projectName": "CRM & Automation",
    "id": 2,
    "excerpt": "A platform designed to manage & organise all of the businesses incoming leads. It tracks each lead through the entire manufacuring process through to delivery.",
    "descriptionP1": "With a large volume of leads and sales coming in each month, the client needed a way to manage those leads and keep track of sales. What started as a CRM has evolved into a platform which not only assists staff in following up on leads, but tracks each order through the entire manufacturing and installation process.",
    "descriptionP2": "From lead to planning to production to installation - each stage has multiple sub-stages that each order passes through depending on the job. This helps every member of the team know exactly where each job is at and what needs to be done.",
    "descriptionP3": "Effectively this app is responsible for managing sales, automating much of the company's operations and providing reports & analysing metrics to further improve performance.",
    "link": "https://crm.supergates.com.au/",
    "mainImage": "./assets/sg-crm-automation-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": false
  },
  {
    "projectName": "Product Creation Server",
    "id": 3,
    "excerpt": "A Node.js/Express server, built specifically for the Supergates Side Gate Builder app. It handles product creation within Stripe prior to initiating checkout.",
    "descriptionP1": "As I was building the Side Gate Builder app, I realised the need to create a server to communicate with Stripe's server to create the product prior to checking out.",
    "descriptionP2": "The server is running Node with Express and I've used Helmet to assist in securing the server and adding the appropriate headers. The server is also being used to analyse various metrics and run reports as required.",
    "descriptionP3": "",
    "mainImage": "./assets/sg-node-express-server-cover.webp",
    "html": true,
    "css": false,
    "js": true,
    "vue": false,
    "tailwind": false,
    "firebase": false,
    "node": true,
    "development": false
  },
  {
    "projectName": "Birch Fit App",
    "id": 4,
    "excerpt": "A weight loss coaching app with a focus on accountability, complete with video calling, food & activity tracking, custom food database, before & after photos and more.",
    "descriptionP1": "Accountability & consistency are the pillars of successful weight loss. This app is designed to provide the ultimate level of accountability.",
    "descriptionP2": "Each day the client and coach connect through in app messaging or through video calls. The client can easily log their food, their workouts and record metrics such as weight, body measurements and before & after photos. It has a custom built food database, ensuring absolute data accuracy which also allows clients to scan food barcodes to record food entries.",
    "descriptionP3": "On the backend, the app continuously analyses client data and alerts the coach whenever a client needs help or is due for a call. This automation allows the coach to take on more clients and offer affordable pricing, which makes weight loss coaching available to the masses. This app is still under development.",
    "link": "https://birchfit.app/",
    "mainImage": "./assets/bf-mobile-app-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": true,
    "development": true
  }
]
}