{ "projects": [
  {
    "projectName": "Side Gate Builder",
    "id": 0,
    "excerpt": "An app designed to make it easier for customers & staff to create side gate packages, send quotes via email and place orders using Stripe. A paid client project.",
    "descriptionP1": "I'm quite proud of this app in particular. I pitched and sold this app to the client, planned the project in advance using GitHub projects and completed building the app one month ahead of schedule.",
    "descriptionP2": "The app saves all quotes to a Firestore database, has Stripe integration for payments and a backend Node.js server used to create new products within Stripe prior to checkout. I used EmailJS to send quote and order emails to both the company and the prospect/client. It also has progressive web app (PWA) functionality.",
    "descriptionP3": "I continue to work with this client, adding new features and maintaining the app. The repo is private to protect my clients' interests, however I'm happy to share the source code in person during an interview.",
    "link": "https://sidegate.supergates.com.au",
    "mainImage": "./assets/sg-diy-side-gate-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": false
  },
  {
    "projectName": "Fencing Estimator",
    "id": 1,
    "excerpt": "The Side Gate Builder was cloned and repurposed to generate fencing & gate estimates and send the estimates to the client via email. A paid client project.",
    "descriptionP1": "During the development process of the Side Gate Builder, the client expressed an interest in having a similar app to be able to generate estimates for fencing & gate projects. ",
    "descriptionP2": "This app also saves all estimates into a Firestore database, is integrated with EmailJS for sending estimates to the client and also generates a PDF of the estimate summary. Apart from the UI which was cloned, all the functionality for this app was completed within approximately 4 weeks, whilst I was simultaneously working on the Side Gate Builder.",
    "descriptionP3": "I continue to work with this client, adding new features and maintaining the app. The repo is private to protect my clients' interests, however I'm happy to share the source code in person during an interview.",
    "link": "https://fencing.supergates.com.au",
    "mainImage": "./assets/fencing-estimator-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": false
  },
  {
    "projectName": "Node/Express Server",
    "id": 2,
    "excerpt": "A Node.js server with Express, built specifically for the Side Gate Builder app. It handles product creation within Stripe prior to initiating checkout.",
    "descriptionP1": "As I was building the Side Gate Builder app, I realised I would need to create a server to communicate with Stripe's server to create the product prior to checking out.",
    "descriptionP2": "The server is running Node with Express and I've used Helmet to assist in securing the server and adding the appropriate headers. Although no one is likely to see this page (outside of my portfolio) I included a visual cue nonetheless to show that the server is operational.",
    "descriptionP3": "This is not the actual production server, but rather a copy of it for use on my portfolio. The repo is private to protect my clients' interests, however I'm happy to share the source code in person during an interview.",
    "link": "https://sg-server-three.vercel.app/",
    "mainImage": "./assets/sg-node-express-server-cover.webp",
    "html": true,
    "css": false,
    "js": true,
    "vue": false,
    "tailwind": false,
    "firebase": false,
    "node": true,
    "development": false
  },
  {
    "projectName": "Time Wise",
    "id": 3,
    "excerpt": "A client time tracker desktop app using Tauri & Vue. Add clients, view task history, log a message with each task, pomodoro mode and detailed stats for each client.",
    "descriptionP1": "I often need to track the hours I work for clients and existing time trackers lacked the features I needed. So I decided to build my own time tracking app.",
    "descriptionP2": "Start by adding a client in the leftmost column. Click on the client you just created to select them. Now you can log time records by clicking the big start button. You'll see an animation which let's you know that you're currently logging time. Enter a message to be included with the record and click on the button again to log the record. The record will now be shown in the history column for that client. You can also pause or reset the timer or use the pomodoro mode to preset the timer to countdown from 20 minutes to zero and automatically log the record. The statistics for each client automatically calculate as you record time logs.",
    "descriptionP3": "Download Time Wise for Mac, Windows or Linux.",
    "link": "",
    "mainImage": "./assets/time-wise-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": false,
    "node": false,
    "development": true
  },
  {
    "projectName": "JS Flashify",
    "id": 4,
    "excerpt": "A flash card learning tool which I started building to help myself and others to memorise JavaScript & Vue fundamentals and common methods.",
    "descriptionP1": "When I began learning JavaScript, I thought about creating my own flash cards to help me memorise common array methods, frequently used functions and fundamental principles. Then it occurred to me, why not create an application instead? So I started to...but then I landed a paying client and I haven't gotten around to completing this project yet.",
    "descriptionP2": "I decided to use Vue.js for this project due to its speed, the ability to build using components and because I think Vue is really cool 😎. The backend is using Firebase for the database, authentication and file storage. As you scroll through the cards, you’re presented with a question. Think about it and answer the question in your head, click on the card to flip it around and view the answer. If you got it right, click on the green box. If you got it wrong, click on the red box. Then proceed to the next card. Your answers to each card are stored in the database. ",
    "descriptionP3": "This project is still under development, however once it’s completed I will be making JS Flashify publicly available for anyone to use as an educational tool.",
    "link": "https://jsflashify.danielbirch.dev/",
    "mainImage": "./assets/js-flashify-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": true
  },
  {
    "projectName": "Rocket Tasks",
    "id": 5,
    "excerpt": "This is my take on the most common application all programmers build, a to do app. It features a date picker, sorting, priority tagging, editing & authentication.",
    "descriptionP1": "My goal with this application was to come up with a clean, simple UI that allows the user to focus on managing and completing their tasks with minimal distractions.",
    "descriptionP2": "Start by choosing the task due date with the date picker, set the priority, enter the name of your to do item and click the check marks or press enter to save the task.",
    "descriptionP3": "To mark as item as complete, just click on it. To sort the task, move it up or down with the arrows. To edit a task, click on the pencil icon and a modal will appear. To delete a task, click on the trash can.",
    "link": "",
    "mainImage": "./assets/rocket-tasks-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": true
  },
  {
    "projectName": "VIPT SaaS",
    "id": 6,
    "excerpt": "A platform for personal trainers which allows them to track their clients progress, create workouts & nutrition plans, send notifications, process payments & more.",
    "descriptionP1": "Before becoming a developer, I was a personal trainer for many years. I know the industry well and I would like to build a management tool to assist personal trainers to operate their business more effectively. There are very few all-in-one platforms available for personal trainers and I'm confident I can built a very competitive alternative.",
    "descriptionP2": "VIPT is my passion project and is still under development. Once it's completed, I plan on offering this application as a commercial product.",
    "descriptionP3": "",
    "link": "",
    "mainImage": "./assets/vipt-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": true,
    "firebase": true,
    "node": true,
    "development": true
  },
  {
    "projectName": "Counter",
    "id": 7,
    "excerpt": "This is the first JavaScript project I completed on my own. I researched and implemented local storage to achieve save, load and reset functionality.",
    "descriptionP1": "Incremental Counter allows the user to keep count by manually clicking the plus and minus buttons. The program allows you to save a number to local storage by clicking ‘Save’, to reset the display to zero by clicking ‘Reset’ and to load the previously saved number by clicking ‘Load’.",
    "descriptionP2": "While building this program I learned about using and interacting with local storage. It was a milestone for me, as it’s the first JavaScript program I wrote by myself.",
    "descriptionP3": "",
    "link": "https://counter.danielbirch.dev/",
    "mainImage": "./assets/counter-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": false,
    "tailwind": false,
    "firebase": false,
    "node": false,
    "development": false
  }
]
}