{ "projects": [
  {
    "projectName": "Side Gate Builder",
    "id": 0,
    "excerpt": "An app designed to make it easier for customers & staff to create side gate packages, send quotes via email and place orders using Stripe. A paid client project.",
    "descriptionP1": "I'm quite proud of this app in particular. I pitched and sold this app to the client, planned the project in advance using GitHub projects and completed building the app one month ahead of schedule.",
    "descriptionP2": "The app saves all quotes to a Firestore database, has Stripe integration for payments and a backend Node.js server used to create new products within Stripe prior to checkout. I used EmailJS to send quote and order emails to both the company and the prospect/client. It also has progressive web app (PWA) functionality.",
    "descriptionP3": "I continue to work with this client, adding new features and maintaining the app. The repo is private to protect my clients' interests, however I'm happy to share the source code in person during an interview.",
    "link": "https://sidegate.supergates.com.au",
    "mainImage": "./assets/sg-diy-side-gate-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": false
  },
  {
    "projectName": "Fencing Estimator",
    "id": 1,
    "excerpt": "The Side Gate Builder was cloned and repurposed to generate fencing & gate estimates and send the estimates to the client via email. A paid client project.",
    "descriptionP1": "During the development process of the Side Gate Builder, the client expressed an interest in having a similar app to be able to generate estimates for fencing & gate projects. ",
    "descriptionP2": "This app also saves all estimates into a Firestore database, is integrated with EmailJS for sending estimates to the client and also generates a PDF of the estimate summary. Apart from the UI which was cloned, all the functionality for this app was completed within approximately 4 weeks, whilst I was simultaneously working on the Side Gate Builder.",
    "descriptionP3": "I continue to work with this client, adding new features and maintaining the app. The repo is private to protect my clients' interests, however I'm happy to share the source code in person during an interview.",
    "link": "https://fencing.supergates.com.au",
    "mainImage": "./assets/fencing-estimator-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": false
  },
  {
    "projectName": "CRM & Automation",
    "id": 2,
    "excerpt": "A platform designed to manage & organise all of the businesses incoming leads. It tracks each lead through the entire manufacuring process through to delivery.",
    "descriptionP1": "1",
    "descriptionP2": "2",
    "descriptionP3": "3",
    "link": "https://crm.supergates.com.au/",
    "mainImage": "./assets/sg-node-express-server-cover.webp",
    "html": true,
    "css": true,
    "js": true,
    "vue": true,
    "tailwind": false,
    "firebase": true,
    "node": false,
    "development": true
  },
  {
    "projectName": "Node/Express Server",
    "id": 3,
    "excerpt": "A Node.js server with Express, built specifically for the Side Gate Builder app. It handles product creation within Stripe prior to initiating checkout.",
    "descriptionP1": "As I was building the Side Gate Builder app, I realised I would need to create a server to communicate with Stripe's server to create the product prior to checking out.",
    "descriptionP2": "The server is running Node with Express and I've used Helmet to assist in securing the server and adding the appropriate headers. Although no one is likely to see this page (outside of my portfolio) I included a visual cue nonetheless to show that the server is operational.",
    "descriptionP3": "This is not the actual production server, but rather a copy of it for use on my portfolio. The repo is private to protect my clients' interests, however I'm happy to share the source code in person during an interview.",
    "mainImage": "./assets/sg-node-express-server-cover.webp",
    "html": true,
    "css": false,
    "js": true,
    "vue": false,
    "tailwind": false,
    "firebase": false,
    "node": true,
    "development": false
  }
]
}